Emacs.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

Use ~M-x org-babel-tangle~ to export this file.

* Installation

- Install fonts with ~M-x all-the-icons-install-fonts~

* Basic UI Configuration
** Basic Window Settings

#+begin_src emacs-lisp
;; Basic Window Settings ;;
(setq inhibit-startup-message t)

; remove unnecessary ui elements
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)

; pad the edge of the window
(set-fringe-mode 10)

; no more annoying bell noises
(setq visible-bell nil)

; keep the cursor away from the edge, and don't jump around when scrolling
(setq scroll-margin 8)
(setq scroll-conservatively 1)

(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Line Numbers

#+begin_src emacs-lisp
;; Line Numbers ;;
; relative line numbers everywhere
(global-display-line-numbers-mode t)
(setq display-line-numbers 'relative)

; show the cursor's current column
(column-number-mode)

; disable line numbers for certain modes
(dolist (mode '(term-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Fonts

#+begin_src emacs-lisp
;; Fonts ;;
(setq cjc/default-font-height 160)
(set-face-attribute 'default nil :font "Roboto Mono" :height cjc/default-font-height)
(set-face-attribute 'fixed-pitch nil :font "Roboto Mono" :height cjc/default-font-height)
(set-face-attribute 'variable-pitch nil :font "Roboto" :height cjc/default-font-height)
#+end_src

* Package Management
** Setup Package Archives

#+begin_src emacs-lisp
;; Setup Package Archives
(require 'package)

; setup the package archives and make sure there is a local copy
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

** Setup use-package

#+begin_src emacs-lisp
;; Setup use-package ;;
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* Keybindings
** Packages
*** Basics

#+begin_src emacs-lisp
;; Basic Keybindings ;;
; let ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src 

*** General

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup)
  (general-create-definer cjc/leader-key
    :states 'normal
    :prefix "SPC"
    :non-normal-prefix "C-SPC"))
#+end_src

*** Which Key

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.5))
#+end_src

*** Evil

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

*** Hydra

#+begin_src emacs-lisp
(use-package hydra
  :after general)
  #+end_src
** Generic Keybinds
All sub-headings will be wrapped in ~with-eval-after-load~.

#+begin_src emacs-lisp
(with-eval-after-load 'general
  (with-eval-after-load 'hydra
#+end_src

*** Buffer Management

#+begin_src emacs-lisp
    (cjc/leader-key
     "b"  '(:ignore b :which-key "buffers")
     "bb" '(counsel-switch-buffer :which-key "switch buffers"))
#+end_src

*** Settings Toggles
**** Text Scaling 

#+begin_src emacs-lisp
    (defhydra hydra-scale-text (:timeout 6)
      "scale editor text"
      ("j" text-scale-increase "in")
      ("k" text-scale-decrease "out")
      ("f" nil "finished" :exit t))
#+end_src

**** Theme Toggling

#+begin_src emacs-lisp
      (defun cjc/toggle-themes ()
        "Switches between a list of themes"
        (interactive)
        (let* ((current-theme (nth cjc/theme-index cjc/theme-list))
               (next-index (mod (+ cjc/theme-index 1) (length cjc/theme-list)))
               (next-theme (nth next-index cjc/theme-list)))
          (disable-theme current-theme)
          (message "Theme: %s" next-theme)
          (setq cjc/theme-index next-index)
          (condition-case nil
              (enable-theme next-theme)
            (error (load-theme next-theme t)))
          (cjc/org-setup-fonts)))
#+end_src

**** Leader Binds

#+begin_src emacs-lisp
    (cjc/leader-key
      "t" '(:ignore t :which-key "toggle settings")
      "tf" '(hydra-scale-text/body :which-key "font scaling")
      "tt" '(cjc/toggle-themes :which-key "theme")
      "tT" '(counsel-load-theme :which-key "theme"))
#+end_src

*** End with-eval-after-load

#+begin_src emacs-lisp
))
#+end_src

* Theming
** Icons
These icons are required for ~doom-modeline~.

#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

** Modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+end_src

** Doom Themes

#+begin_src emacs-lisp
;(setq cjc/default-dark-theme 'doom-palenight)
(setq cjc/default-dark-theme 'doom-challenger-deep)
(setq cjc/default-light-theme 'doom-solarized-light)
(setq cjc/theme-list
  (list cjc/default-dark-theme
        cjc/default-light-theme))
(setq cjc/theme-index 0)

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold nil
	doom-themes-enable-italic nil)
  (load-theme (car cjc/theme-list) t)
  (doom-themes-org-config))
#+end_src

** Rainbow Delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Development Packages
** Ivy

#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (:map ivy-minibuffer-map
              ("TAB" . ivy-alt-done)
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line))
  :config
  (ivy-mode 1))

(use-package counsel
  :config
  (counsel-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package swiper
  :after ivy
  :bind (("C-s" . swiper)))

(use-package ivy-posframe
  :config
  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display)))
  (ivy-posframe-mode 1))
;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-center)))
;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-left)))
;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-window-bottom-left)))
;; (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center)))
#+end_src

** Git

#+begin_src emacs-lisp
(use-package forge)
(use-package magit
  :config
  (cjc/leader-key
   "g"  '(:ignore g :which-key "git")
   "gs" '(magit-status :which-key "status")
   "gb" '(magit-branch :which-key "branch")
   "gc" '(magit-branch-or-checkout :which-key "branch or checkout")))

(when (eq system-type 'windows-nt)
  (setenv "SSH_ASKPASS" "git-gui--askpass")
  (use-package ssh-agency))
#+end_src

** Projectile

#+begin_src emacs-lisp
(use-package projectile
  :after (general ivy)
  :diminish projectile-mode
  :init
  (setq projectile-project-search-path '())
  (when (file-directory-p "~/dev") (push "~/dev" projectile-project-search-path))
  (when (file-directory-p "~/work") (push "~/work" projectile-project-search-path))

  (setq projectile-completion-system 'ivy)

  :config
  (projectile-mode 1)
  (cjc/leader-key
    "p" '(:keymap projectile-command-map :wk "projectile")))
#+end_src

** LSP

#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :config
  (cjc/leader-key
    "l" '(:keymap lsp-command-map :wk "lsp"))
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))
#+end_src

** Company

#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
          ("<tab>" . company-complete-selection))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.1))

(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** Languages
*** Typescript / Javascript

#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.tsx?\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+end_src

* Terminals
** Basic Settings
#+begin_src emacs-lisp
(defun cjc/all-term-mode-hook ()
  (setq scroll-margin 0))

(add-hook 'eshell-mode-hook 'cjc-all-term-mode-hook)
#+end_src

* Org Mode
** Org

All sub-headings in this section are contained within the top level use-package.

#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . cjc/org-mode-setup)
  :config
#+end_src

*** Basic Settings

#+begin_src emacs-lisp
  ;; Basic Settings ;;
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t)
#+end_src

*** Agenda Settings

#+begin_src emacs-lisp
  ;; Agenda Settings ;;
  (setq org-agenda-start-with-log-mode t
        org-log-done 'time
        org-log-into-drawer t
        org-agenda-files
        '("~/Google Drive/Org Notes/Tasks.org"
          "~/Google Drive/Org Notes/Birthdays.org")
        org-todo-keywords
        '(("TODO(t)" "NEXT(n)" "|" "DONE(d!)" "CANCELLED(C@)")))

  (setq org-refile-targets
    '(("Archive.org" :maxlevel . 1)
      ("Tasks.org" :maxlevel . 1)))

  ; save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  ; configure custom agenda views
  (setq org-agenda-custom-commands
   '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))
      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

    ("n" "Next Tasks"
     ((todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))))

    ("h" "Home Tasks" tags-todo "+work")
    ("w" "Work Tasks" tags-todo "+home")
    ("m" "Work Tasks" tags-todo "+media")))

  ; default tags
  (setq org-tag-alist
    '((:startgroup)
      (:endgroup)
      ("home" . ?H)
      ("work" . ?W)
      ("note" . ?N)
      ("media" . ?M)))
#+end_src

*** Load Org Babel Languages

#+begin_src emacs-lisp
  ;; Load Org Babel Languages ;;
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)
#+end_src

*** Automatically Tangle Configuration

#+begin_src emacs-lisp
;; Automatically Tangle Configuration ;;
  (defun cjc/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/Emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook
                               #'cjc/org-babel-tangle-config)))
#+end_src

*** Org Tempo Snippets

#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+end_src

*** Fonts

#+begin_src emacs-lisp
  (defun cjc/org-setup-fonts ()
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
        (set-face-attribute (car face) nil :font "Roboto" :weight 'regular :height (cdr face)))

    ; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
  (cjc/org-setup-fonts)
#+end_src

*** Helper Functions

#+begin_src emacs-lisp
(defun cjc/org-toggle-emphasis ()
  "Toggle hiding/showing of org emphasize markers."
  (interactive)
  (if org-hide-emphasis-markers
      (set-variable 'org-hide-emphasis-markers nil)
    (set-variable 'org-hide-emphasis-markers t))
  (org-mode-restart))
#+end_src

#+begin_src emacs-lisp
(defun cjc/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil))
#+end_src

*** Keybinds

#+begin_src emacs-lisp
  (cjc/leader-key
    :keymaps 'org-mode-map
    "m" '(:ignore t :which-key "org-mode")
    "me" '(cjc/org-toggle-emphasis :which-key "toggle emphasis"))
#+end_src

*** End use-package org

#+begin_src emacs-lisp
)
#+end_src

** Org Superstar

#+begin_src emacs-lisp
(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("❖" "✱" "✹" "✸" "✦" "✧")
	org-superstar-leading-bullet " "))
#+end_src
* Things To Check Out
** "helpful" Package
Adds extra information to emacs help pages

** org-appear Package
Dynamically shows/hides markup in org mode based on cursor position.

** ivy-posframe
Sticks ivy completion buffers into posframe popout windows

** ivy-rich
Already installed, but make sure it's doing doing something and check out advanced config

** smart-modeline
Alternative to doom-modeline

** TODO highlighting
Find a package for it
